var addon_dictionary = {
	"fm": {
		"name": "禁忌魔法",
		"aspects":["暴怒", "下界", "饕餮", "妒忌", "怠倦", "傲慢", "欲望"],
		"combinations":{
			"暴怒": ["武器", "火"],
			"下界": ["火", "魔法"],
			"饕餮": ["饥饿", "饥饿"],
			"妒忌": ["感知", "饥饿"],
			"怠倦": ["陷阱", "灵魂"],
			"傲慢": ["飞行", "虚空"],
			"欲望": ["血肉", "饥饿"]
		} 
	},
	"mb": {
		"name": "魔法蜜蜂",
		"aspects":["时间"],
		"combinations":{
			"时间": ["虚空", "秩序"]
		} 
	}
	/*
	"tr": {
		"name": "神秘启示录",
		"aspects":["守护", "柑橘", "磁力", "波动", "启示"],
		"combinations":{
			"守护": ["异域", "死亡"],
			"柑橘": ["植物", "感知"],
			"磁力": ["金属", "能量"],
			"波动": ["磁力", "机械"],
			"启示": ["异域", "神智"]
		} 
	}
	*/
};
