var addon_dictionary = {
	"fm": {
		"name": "禁忌魔法",
		"aspects":["暴怒", "下界", "饕餮", "妒忌", "怠倦", "傲慢", "欲望"],
		"combinations":{
			"暴怒": ["武器", "火"],
			"下界": ["火", "魔法"],
			"饕餮": ["饥饿", "饥饿"],
			"妒忌": ["感知", "饥饿"],
			"怠倦": ["陷阱", "灵魂"],
			"傲慢": ["飞行", "虚空"],
			"欲望": ["血肉", "饥饿"]
		} 
	},
	"mb": {
		"name": "魔法蜜蜂",
		"aspects":["时间"],
		"combinations":{
			"时间": ["虚空", "秩序"]
		} 
	},
        "gt": {
        	"name": "格雷科技",
        	"aspects": ["电力", "磁性", "欺诈", "辐射", "愚锶"],
        	"combinations": {
        		"电力": ["能量", "机械"],
        		"磁性": ["金属", "旅行"],
        		"欺诈": ["采掘", "贪婪"],
        		"辐射": ["光明", "能量"],
        		"愚锶": ["混沌", "神智"]
        		}
        }
	/*
	"tr": {
		"name": "神秘启示录",
		"aspects":["守护", "柑橘", "磁力", "波动", "启示"],
		"combinations":{
			"守护": ["异域", "死亡"],
			"柑橘": ["植物", "感知"],
			"磁力": ["金属", "能量"],
			"波动": ["磁力", "机械"],
			"启示": ["异域", "神智"]
		} 
	}
	*/
};
